STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U5xx/Include/stm32u5xxxxx.h
/*!< AHB2 Secure peripherals */
#define GPIOA_BASE_S            (AHB2PERIPH_BASE_S + 0x00000UL)
#define GPIOB_BASE_S            (AHB2PERIPH_BASE_S + 0x00400UL)
#define GPIOC_BASE_S            (AHB2PERIPH_BASE_S + 0x00800UL)
#define GPIOD_BASE_S            (AHB2PERIPH_BASE_S + 0x00C00UL)
#define GPIOE_BASE_S            (AHB2PERIPH_BASE_S + 0x01000UL)
#if !$U5_512K$
#define GPIOF_BASE_S            (AHB2PERIPH_BASE_S + 0x01400UL)
#endif /* !U5_512K */
#define GPIOG_BASE_S            (AHB2PERIPH_BASE_S + 0x01800UL)
#define GPIOH_BASE_S            (AHB2PERIPH_BASE_S + 0x01C00UL)
#if !$U5_512K$
#define GPIOI_BASE_S            (AHB2PERIPH_BASE_S + 0x02000UL)
#endif /* !U5_512K */
#if $U5_4M$
#define GPIOJ_BASE_S            (AHB2PERIPH_BASE_S + 0x02400UL)
#endif /* $U5_4M$ */
#define ADC1_BASE_S             (AHB2PERIPH_BASE_S + 0x08000UL)
#if $U5_4M$
#define ADC2_BASE_S             (AHB2PERIPH_BASE_S + 0x08100UL)
#define ADC12_COMMON_BASE_S     (AHB2PERIPH_BASE_S + 0x08300UL)
#else
#define ADC12_COMMON_BASE_S     (AHB2PERIPH_BASE_S + 0x08308UL)
#endif /* $U5_4M$ */
#define DCMI_BASE_S             (AHB2PERIPH_BASE_S + 0x0C000UL)
#define PSSI_BASE_S             (AHB2PERIPH_BASE_S + 0x0C400UL)
#if $U5_4M$
#define USB_OTG_HS_BASE_S       (AHB2PERIPH_BASE_S + 0x20000UL)
#elif !$U5_512K$
#define USB_OTG_FS_BASE_S       (AHB2PERIPH_BASE_S + 0x20000UL)
#elif $U5_512K$
#define USB_DRD_BASE_S          (APB2PERIPH_BASE_S + 0x06000UL)
#define USB_DRD_PMAADDR_S       (APB2PERIPH_BASE_S + 0x06400UL)
#endif /* $U5_4M$ */
#if $U5_CRYPTO$
#define AES_BASE_S              (AHB2PERIPH_BASE_S + 0xA0000UL)
#endif /* U5_CRYPTO */
#define HASH_BASE_S             (AHB2PERIPH_BASE_S + 0xA0400UL)
#define HASH_DIGEST_BASE_S      (AHB2PERIPH_BASE_S + 0xA0710UL)
#define RNG_BASE_S              (AHB2PERIPH_BASE_S + 0xA0800UL)
#if $U5_CRYPTO$
#define SAES_BASE_S             (AHB2PERIPH_BASE_S + 0xA0C00UL)
#define PKA_BASE_S              (AHB2PERIPH_BASE_S + 0xA2000UL)
#define PKA_RAM_BASE_S          (AHB2PERIPH_BASE_S + 0xA2400UL)
#define OTFDEC1_BASE_S          (AHB2PERIPH_BASE_S + 0xA5000UL)
#define OTFDEC1_REGION1_BASE_S  (OTFDEC1_BASE_S + 0x20UL)
#define OTFDEC1_REGION2_BASE_S  (OTFDEC1_BASE_S + 0x50UL)
#define OTFDEC1_REGION3_BASE_S  (OTFDEC1_BASE_S + 0x80UL)
#define OTFDEC1_REGION4_BASE_S  (OTFDEC1_BASE_S + 0xB0UL)
#if !$U5_512K$
#define OTFDEC2_BASE_S          (AHB2PERIPH_BASE_S + 0xA5400UL)
#define OTFDEC2_REGION1_BASE_S  (OTFDEC2_BASE_S + 0x20UL)
#define OTFDEC2_REGION2_BASE_S  (OTFDEC2_BASE_S + 0x50UL)
#define OTFDEC2_REGION3_BASE_S  (OTFDEC2_BASE_S + 0x80UL)
#define OTFDEC2_REGION4_BASE_S  (OTFDEC2_BASE_S + 0xB0UL)
#endif /* !U5_512K */
#endif /* U5_CRYPTO */
#if !$U5_512K$
#define OCTOSPIM_R_BASE_S       (AHB2PERIPH_BASE_S + 0xA4000UL) /*!< OCTOSPIM control registers base address */
#endif /* !U5_512K */
#define SDMMC1_BASE_S           (AHB2PERIPH_BASE_S + 0xA8000UL)
#if !$U5_512K$
#define SDMMC2_BASE_S           (AHB2PERIPH_BASE_S + 0xA8C00UL)
#endif /* !U5_512K */
#define DLYB_SDMMC1_BASE_S      (AHB2PERIPH_BASE_S + 0xA8400UL)
#if !$U5_512K$
#define DLYB_SDMMC2_BASE_S      (AHB2PERIPH_BASE_S + 0xA8800UL)
#endif /* !U5_512K */
#define DLYB_OCTOSPI1_BASE_S    (AHB2PERIPH_BASE_S + 0xAF000UL)
#if !$U5_512K$
#define DLYB_OCTOSPI2_BASE_S    (AHB2PERIPH_BASE_S + 0xAF400UL)
#define FMC_R_BASE_S            (AHB2PERIPH_BASE_S + 0xB0400UL) /*!< FMC  control registers base address     */
#endif /* !U5_512K */
#if $U5_4M$
#define HSPI1_R_BASE_S          (AHB2PERIPH_BASE_S + 0xB3400UL)
#endif /* $U5_4M$ */
#if !$U5_512K$
#define FMC_Bank1_R_BASE_S      (FMC_R_BASE_S + 0x0000UL)
#define FMC_Bank1E_R_BASE_S     (FMC_R_BASE_S + 0x0104UL)
#define FMC_Bank3_R_BASE_S      (FMC_R_BASE_S + 0x0080UL)
#endif /* !U5_512K */
#define OCTOSPI1_R_BASE_S       (AHB2PERIPH_BASE_S + 0xB1400UL) /*!< OCTOSPI1 control registers base address */
#if !$U5_512K$
#define OCTOSPI2_R_BASE_S       (AHB2PERIPH_BASE_S + 0xB2400UL) /*!< OCTOSPI2 control registers base address */
#endif /* !U5_512K */

/*!< AHB3 Secure peripherals */
#define LPGPIO1_BASE_S          (AHB3PERIPH_BASE_S)
#define PWR_BASE_S              (AHB3PERIPH_BASE_S + 0x0800UL)
#define RCC_BASE_S              (AHB3PERIPH_BASE_S + 0x0C00UL)
#define ADC4_BASE_S             (AHB3PERIPH_BASE_S + 0x1000UL)
#if $U5_4M$
#define ADC4_COMMON_BASE_S      (AHB3PERIPH_BASE_S + 0x1300UL)
#else
#define ADC4_COMMON_BASE_S      (AHB3PERIPH_BASE_S + 0x1308UL)
#endif /* $U5_4M$ */
#define DAC1_BASE_S             (AHB3PERIPH_BASE_S + 0x1800UL)
#define EXTI_BASE_S             (AHB3PERIPH_BASE_S + 0x2000UL)
#define GTZC_TZSC2_BASE_S       (AHB3PERIPH_BASE_S + 0x3000UL)
#define GTZC_TZIC2_BASE_S       (AHB3PERIPH_BASE_S + 0x3400UL)
#define GTZC_MPCBB4_BASE_S      (AHB3PERIPH_BASE_S + 0x3800UL)
#define ADF1_BASE_S             (AHB3PERIPH_BASE_S + 0x4000UL)
#define ADF1_Filter0_BASE_S     (ADF1_BASE_S + 0x80UL)
#define LPDMA1_BASE_S           (AHB3PERIPH_BASE_S + 0x5000UL)
#define LPDMA1_Channel0_BASE_S  (LPDMA1_BASE_S + 0x0050UL)
#define LPDMA1_Channel1_BASE_S  (LPDMA1_BASE_S + 0x00D0UL)
#define LPDMA1_Channel2_BASE_S  (LPDMA1_BASE_S + 0x0150UL)
#define LPDMA1_Channel3_BASE_S  (LPDMA1_BASE_S + 0x01D0UL)

#if $U5_GFX$
/* GFXMMU secure virtual buffers base address */
#define GFXMMU_VIRTUAL_BUFFERS_BASE_S  (0x34000000UL)
#define GFXMMU_VIRTUAL_BUFFER0_BASE_S  (GFXMMU_VIRTUAL_BUFFERS_BASE_S)
#define GFXMMU_VIRTUAL_BUFFER1_BASE_S  (GFXMMU_VIRTUAL_BUFFERS_BASE_S + 0x400000UL)
#define GFXMMU_VIRTUAL_BUFFER2_BASE_S  (GFXMMU_VIRTUAL_BUFFERS_BASE_S + 0x800000UL)
#define GFXMMU_VIRTUAL_BUFFER3_BASE_S  (GFXMMU_VIRTUAL_BUFFERS_BASE_S + 0xC00000UL)
#endif /* $U5_GFX$ */

/* Debug MCU registers base address */
#define DBGMCU_BASE             (0xE0044000UL)
#define PACKAGE_BASE            (0x0BFA0500UL) /*!< Package data register base address     */
#define UID_BASE                (0x0BFA0700UL) /*!< Unique device ID register base address */
#define FLASHSIZE_BASE          (0x0BFA07A0UL) /*!< Flash size data register base address  */

/* Internal Flash OTP Area */
#define FLASH_OTP_BASE          (0x0BFA0000UL) /*!< FLASH OTP (one-time programmable) base address */
#define FLASH_OTP_SIZE          (0x200U)       /*!< 512 bytes OTP (one-time programmable)          */

#if !$U5_512K$
/* USB OTG registers Base address */
#define USB_OTG_GLOBAL_BASE                  (0x0000UL)
#define USB_OTG_DEVICE_BASE                  (0x0800UL)
#define USB_OTG_IN_ENDPOINT_BASE             (0x0900UL)
#define USB_OTG_OUT_ENDPOINT_BASE            (0x0B00UL)
#define USB_OTG_EP_REG_SIZE                  (0x0020UL)
#define USB_OTG_HOST_BASE                    (0x0400UL)
#define USB_OTG_HOST_PORT_BASE               (0x0440UL)
#define USB_OTG_HOST_CHANNEL_BASE            (0x0500UL)
#define USB_OTG_HOST_CHANNEL_SIZE            (0x0020UL)
#define USB_OTG_PCGCCTL_BASE                 (0x0E00UL)
#define USB_OTG_FIFO_BASE                    (0x1000UL)
#define USB_OTG_FIFO_SIZE                    (0x1000UL)
#endif /* !U5_512K */

/*!< Root Secure Service Library */
/************ RSSLIB SAU system Flash region definition constants *************/
#define RSSLIB_SYS_FLASH_NS_PFUNC_START   (0x0BF99E40UL)
#define RSSLIB_SYS_FLASH_NS_PFUNC_END     (0x0BF99EFFUL)

