STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U5xx/Include/stm32u5xxxxx.h
#if $U5_4M$
#define HSPI1                          HSPI1_S
#define HSPI1_R_BASE                   HSPI1_R_BASE_S

#endif /* $U5_4M$ */
#if !$U5_512K$
#define DMA2D                          DMA2D_S
#define DMA2D_BASE                     DMA2D_BASE_S
#endif /* !U5_512K */

#if $U5_4M$
#define USB_OTG_HS                     USB_OTG_HS_S
#define USB_OTG_HS_BASE                USB_OTG_HS_BASE_S
#elif !$U5_512K$
#define USB_OTG_FS                     USB_OTG_FS_S
#define USB_OTG_FS_BASE                USB_OTG_FS_BASE_S
#elif $U5_512K$
#define USB_DRD_FS                     USB_DRD_FS_S
#define USB_DRD_BASE                   USB_DRD_BASE_S
#define USB_DRD_PMAADDR                USB_DRD_PMAADDR_S
#define USB_DRD_PMA_BUFF               USB_DRD_PMA_BUFF_S
#endif /* $U5_4M$ */

#define MDF1                           MDF1_S
#define MDF1_BASE                      MDF1_BASE_S

#define MDF1_Filter0                   MDF1_Filter0_S
#define MDF1_Filter0_BASE              MDF1_Filter0_BASE_S

#define MDF1_Filter1                   MDF1_Filter1_S
#define MDF1_Filter1_BASE              MDF1_Filter1_BASE_S

#define MDF1_Filter2                   MDF1_Filter2_S
#define MDF1_Filter2_BASE              MDF1_Filter2_BASE_S

#define MDF1_Filter3                   MDF1_Filter3_S
#define MDF1_Filter3_BASE              MDF1_Filter3_BASE_S

#define MDF1_Filter4                   MDF1_Filter4_S
#define MDF1_Filter4_BASE              MDF1_Filter4_BASE_S

#define MDF1_Filter5                   MDF1_Filter5_S
#define MDF1_Filter5_BASE              MDF1_Filter5_BASE_S

#define ADF1                           ADF1_S
#define ADF1_BASE                      ADF1_BASE_S

#define ADF1_Filter0                   ADF1_Filter0_S
#define ADF1_Filter0_BASE              ADF1_Filter0_BASE_S

#if $U5_GFX$
#define GFXMMU                         GFXMMU_S
#define GFXMMU_BASE                    GFXMMU_BASE_S
/* GFXMMU virtual buffers base address */
#define GFXMMU_VIRTUAL_BUFFERS_BASE    GFXMMU_VIRTUAL_BUFFERS_BASE_S
#define GFXMMU_VIRTUAL_BUFFER0_BASE    GFXMMU_VIRTUAL_BUFFER0_BASE_S
#define GFXMMU_VIRTUAL_BUFFER1_BASE    GFXMMU_VIRTUAL_BUFFER1_BASE_S
#define GFXMMU_VIRTUAL_BUFFER2_BASE    GFXMMU_VIRTUAL_BUFFER2_BASE_S
#define GFXMMU_VIRTUAL_BUFFER3_BASE    GFXMMU_VIRTUAL_BUFFER3_BASE_S

#define GPU2D                          GPU2D_BASE_S

#define LTDC                           LTDC_S
#define LTDC_BASE                      LTDC_BASE_S

#define LTDC_Layer1_BASE               LTDC_Layer1_BASE_S
#define LTDC_Layer2_BASE               LTDC_Layer2_BASE_S

#if !$U5_DSI$
#define DSI                            DSI_S
#define DSI_BASE                       DSI_BASE_S
#endif /* !U5_DSI */

#define REFBIAS                        REFBIAS_S
#define REFBIAS_BASE                   REFBIAS_BASE_S

#define DPHY                           DPHY_S
#define DPHY_BASE                      DPHY_BASE_S

#endif /* $U5_GFX$ */
#if $U5_TIGER$
#define JPEG                           JPEG_S
#define JPEG_BASE                      JPEG_BASE_S

#define GFXTIM                         GFXTIM_S
#define GFXTIM_BASE                    GFXTIM_BASE_S
#endif /* $U5_TIGER$ */
#else
/*!< Memory base addresses for Non secure peripherals */
#define FLASH_BASE                     FLASH_BASE_NS
#define SRAM1_BASE                     SRAM1_BASE_NS
#define SRAM2_BASE                     SRAM2_BASE_NS
#if !$U5_512K$
#define SRAM3_BASE                     SRAM3_BASE_NS
#endif /* !U5_512K */
#define SRAM4_BASE                     SRAM4_BASE_NS
#if $U5_4M$
#define SRAM5_BASE                     SRAM5_BASE_NS
#endif /* $U5_4M$ */
#define BKPSRAM_BASE                   BKPSRAM_BASE_NS
#if $U5_TIGER$
#define SRAM6_BASE                     SRAM6_BASE_NS
#endif /* $U5_TIGER$ */
#define PERIPH_BASE                    PERIPH_BASE_NS
#define APB1PERIPH_BASE                APB1PERIPH_BASE_NS
#define APB2PERIPH_BASE                APB2PERIPH_BASE_NS
#define AHB1PERIPH_BASE                AHB1PERIPH_BASE_NS
#define AHB2PERIPH_BASE                AHB2PERIPH_BASE_NS

/*!< Instance aliases and base addresses for Non secure peripherals */
#define CORDIC                         CORDIC_NS
#define CORDIC_BASE                    CORDIC_BASE_NS

#define RCC                            RCC_NS
#define RCC_BASE                       RCC_BASE_NS

#if !$U5_512K$
#define DMA2D                          DMA2D_NS
#define DMA2D_BASE                     DMA2D_BASE_NS
#endif /* !U5_512K */

#define DCMI                           DCMI_NS
#define DCMI_BASE                      DCMI_BASE_NS

#define PSSI                           PSSI_NS
#define PSSI_BASE                      PSSI_BASE_NS

#define FLASH                          FLASH_NS
#define FLASH_R_BASE                   FLASH_R_BASE_NS

#define FMAC                           FMAC_NS
#define FMAC_BASE                      FMAC_BASE_NS

#define GPDMA1                         GPDMA1_NS
#define GPDMA1_BASE                    GPDMA1_BASE_NS

#define GPDMA1_Channel0                GPDMA1_Channel0_NS
#define GPDMA1_Channel0_BASE           GPDMA1_Channel0_BASE_NS

#define GPDMA1_Channel1                GPDMA1_Channel1_NS
#define GPDMA1_Channel1_BASE           GPDMA1_Channel1_BASE_NS

#define GPDMA1_Channel2                GPDMA1_Channel2_NS
#define GPDMA1_Channel2_BASE           GPDMA1_Channel2_BASE_NS

#define GPDMA1_Channel3                GPDMA1_Channel3_NS
#define GPDMA1_Channel3_BASE           GPDMA1_Channel3_BASE_NS

#define GPDMA1_Channel4                GPDMA1_Channel4_NS
#define GPDMA1_Channel4_BASE           GPDMA1_Channel4_BASE_NS

#define GPDMA1_Channel5                GPDMA1_Channel5_NS
#define GPDMA1_Channel5_BASE           GPDMA1_Channel5_BASE_NS

#define GPDMA1_Channel6                GPDMA1_Channel6_NS
#define GPDMA1_Channel6_BASE           GPDMA1_Channel6_BASE_NS

#define GPDMA1_Channel7                GPDMA1_Channel7_NS
#define GPDMA1_Channel7_BASE           GPDMA1_Channel7_BASE_NS

#define GPDMA1_Channel8                GPDMA1_Channel8_NS
#define GPDMA1_Channel8_BASE           GPDMA1_Channel8_BASE_NS

#define GPDMA1_Channel9                GPDMA1_Channel9_NS
#define GPDMA1_Channel9_BASE           GPDMA1_Channel9_BASE_NS

