STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U5xx/Include/stm32u5xxxxx.h
/********************  Bit definition for PWR_PDCRH register  *****************/
#define PWR_PDCRH_PD0_Pos                   (0UL)
#define PWR_PDCRH_PD0_Msk                   (0x1UL << PWR_PDCRH_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRH_PD0                       PWR_PDCRH_PD0_Msk                       /*!< Apply pull-down for PH0  */
#define PWR_PDCRH_PD1_Pos                   (1UL)
#define PWR_PDCRH_PD1_Msk                   (0x1UL << PWR_PDCRH_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRH_PD1                       PWR_PDCRH_PD1_Msk                       /*!< Apply pull-down for PH1  */
#if !$U5_512K$
#define PWR_PDCRH_PD2_Pos                   (2UL)
#define PWR_PDCRH_PD2_Msk                   (0x1UL << PWR_PDCRH_PD2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRH_PD2                       PWR_PDCRH_PD2_Msk                       /*!< Apply pull-down for PH2  */
#endif /* !$U5_512K$ */
#define PWR_PDCRH_PD3_Pos                   (3UL)
#define PWR_PDCRH_PD3_Msk                   (0x1UL << PWR_PDCRH_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRH_PD3                       PWR_PDCRH_PD3_Msk                       /*!< Apply pull-down for PH3  */
#if !$U5_512K$
#define PWR_PDCRH_PD4_Pos                   (4UL)
#define PWR_PDCRH_PD4_Msk                   (0x1UL << PWR_PDCRH_PD4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRH_PD4                       PWR_PDCRH_PD4_Msk                       /*!< Apply pull-down for PH4  */
#define PWR_PDCRH_PD5_Pos                   (5UL)
#define PWR_PDCRH_PD5_Msk                   (0x1UL << PWR_PDCRH_PD5_Pos)            /*!< 0x00000020 */
#define PWR_PDCRH_PD5                       PWR_PDCRH_PD5_Msk                       /*!< Apply pull-down for PH5  */
#define PWR_PDCRH_PD6_Pos                   (6UL)
#define PWR_PDCRH_PD6_Msk                   (0x1UL << PWR_PDCRH_PD6_Pos)            /*!< 0x00000040 */
#define PWR_PDCRH_PD6                       PWR_PDCRH_PD6_Msk                       /*!< Apply pull-down for PH6  */
#define PWR_PDCRH_PD7_Pos                   (7UL)
#define PWR_PDCRH_PD7_Msk                   (0x1UL << PWR_PDCRH_PD7_Pos)            /*!< 0x00000080 */
#define PWR_PDCRH_PD7                       PWR_PDCRH_PD7_Msk                       /*!< Apply pull-down for PH7  */
#define PWR_PDCRH_PD8_Pos                   (8UL)
#define PWR_PDCRH_PD8_Msk                   (0x1UL << PWR_PDCRH_PD8_Pos)            /*!< 0x00000100 */
#define PWR_PDCRH_PD8                       PWR_PDCRH_PD8_Msk                       /*!< Apply pull-down for PH8  */
#define PWR_PDCRH_PD9_Pos                   (9UL)
#define PWR_PDCRH_PD9_Msk                   (0x1UL << PWR_PDCRH_PD9_Pos)            /*!< 0x00000200 */
#define PWR_PDCRH_PD9                       PWR_PDCRH_PD9_Msk                       /*!< Apply pull-down for PH9  */
#define PWR_PDCRH_PD10_Pos                  (10UL)
#define PWR_PDCRH_PD10_Msk                  (0x1UL << PWR_PDCRH_PD10_Pos)           /*!< 0x00000400 */
#define PWR_PDCRH_PD10                      PWR_PDCRH_PD10_Msk                      /*!< Apply pull-down for PH10 */
#define PWR_PDCRH_PD11_Pos                  (11UL)
#define PWR_PDCRH_PD11_Msk                  (0x1UL << PWR_PDCRH_PD11_Pos)           /*!< 0x00000800 */
#define PWR_PDCRH_PD11                      PWR_PDCRH_PD11_Msk                      /*!< Apply pull-down for PH11 */
#define PWR_PDCRH_PD12_Pos                  (12UL)
#define PWR_PDCRH_PD12_Msk                  (0x1UL << PWR_PDCRH_PD12_Pos)           /*!< 0x00001000 */
#define PWR_PDCRH_PD12                      PWR_PDCRH_PD12_Msk                      /*!< Apply pull-down for PH12 */
#define PWR_PDCRH_PD13_Pos                  (13UL)
#define PWR_PDCRH_PD13_Msk                  (0x1UL << PWR_PDCRH_PD13_Pos)           /*!< 0x00002000 */
#define PWR_PDCRH_PD13                      PWR_PDCRH_PD13_Msk                      /*!< Apply pull-down for PH13 */
#define PWR_PDCRH_PD14_Pos                  (14UL)
#define PWR_PDCRH_PD14_Msk                  (0x1UL << PWR_PDCRH_PD14_Pos)           /*!< 0x00004000 */
#define PWR_PDCRH_PD14                      PWR_PDCRH_PD14_Msk                      /*!< Apply pull-down for PH14 */
#define PWR_PDCRH_PD15_Pos                  (15UL)
#define PWR_PDCRH_PD15_Msk                  (0x1UL << PWR_PDCRH_PD15_Pos)           /*!< 0x00008000 */
#define PWR_PDCRH_PD15                      PWR_PDCRH_PD15_Msk                      /*!< Apply pull-down for PH15 */
#endif /* !$U5_512K$ */

#if !$U5_512K$
/********************  Bit definition for PWR_PUCRI register  *****************/
#define PWR_PUCRI_PU0_Pos                   (0UL)
#define PWR_PUCRI_PU0_Msk                   (0x1UL << PWR_PUCRI_PU0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRI_PU0                       PWR_PUCRI_PU0_Msk                       /*!< Apply pull-up for PI0  */
#define PWR_PUCRI_PU1_Pos                   (1UL)
#define PWR_PUCRI_PU1_Msk                   (0x1UL << PWR_PUCRI_PU1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRI_PU1                       PWR_PUCRI_PU1_Msk                       /*!< Apply pull-up for PI1  */
#define PWR_PUCRI_PU2_Pos                   (2UL)
#define PWR_PUCRI_PU2_Msk                   (0x1UL << PWR_PUCRI_PU2_Pos)            /*!< 0x00000004 */
#define PWR_PUCRI_PU2                       PWR_PUCRI_PU2_Msk                       /*!< Apply pull-up for PI2  */
#define PWR_PUCRI_PU3_Pos                   (3UL)
#define PWR_PUCRI_PU3_Msk                   (0x1UL << PWR_PUCRI_PU3_Pos)            /*!< 0x00000008 */
#define PWR_PUCRI_PU3                       PWR_PUCRI_PU3_Msk                       /*!< Apply pull-up for PI3  */
#define PWR_PUCRI_PU4_Pos                   (4UL)
#define PWR_PUCRI_PU4_Msk                   (0x1UL << PWR_PUCRI_PU4_Pos)            /*!< 0x00000010 */
#define PWR_PUCRI_PU4                       PWR_PUCRI_PU4_Msk                       /*!< Apply pull-up for PI4  */
#define PWR_PUCRI_PU5_Pos                   (5UL)
#define PWR_PUCRI_PU5_Msk                   (0x1UL << PWR_PUCRI_PU5_Pos)            /*!< 0x00000020 */
#define PWR_PUCRI_PU5                       PWR_PUCRI_PU5_Msk                       /*!< Apply pull-up for PI5  */
#define PWR_PUCRI_PU6_Pos                   (6UL)
#define PWR_PUCRI_PU6_Msk                   (0x1UL << PWR_PUCRI_PU6_Pos)            /*!< 0x00000040 */
#define PWR_PUCRI_PU6                       PWR_PUCRI_PU6_Msk                       /*!< Apply pull-up for PI6  */
#define PWR_PUCRI_PU7_Pos                   (7UL)
#define PWR_PUCRI_PU7_Msk                   (0x1UL << PWR_PUCRI_PU7_Pos)            /*!< 0x00000080 */
#define PWR_PUCRI_PU7                       PWR_PUCRI_PU7_Msk                       /*!< Apply pull-up for PI7  */
#if $U5_4M$
#define PWR_PUCRI_PU8_Pos                   (8UL)
#define PWR_PUCRI_PU8_Msk                   (0x1UL << PWR_PUCRI_PU8_Pos)            /*!< 0x00000100 */
#define PWR_PUCRI_PU8                       PWR_PUCRI_PU8_Msk                       /*!< Apply pull-up for PI8  */
#define PWR_PUCRI_PU9_Pos                   (9UL)
#define PWR_PUCRI_PU9_Msk                   (0x1UL << PWR_PUCRI_PU9_Pos)            /*!< 0x00000200 */
#define PWR_PUCRI_PU9                       PWR_PUCRI_PU9_Msk                       /*!< Apply pull-up for PI9  */
#define PWR_PUCRI_PU10_Pos                  (10UL)
#define PWR_PUCRI_PU10_Msk                  (0x1UL << PWR_PUCRI_PU10_Pos)           /*!< 0x00000400 */
#define PWR_PUCRI_PU10                      PWR_PUCRI_PU10_Msk                      /*!< Apply pull-up for PI10 */
#define PWR_PUCRI_PU11_Pos                  (11UL)
#define PWR_PUCRI_PU11_Msk                  (0x1UL << PWR_PUCRI_PU11_Pos)           /*!< 0x00000800 */
#define PWR_PUCRI_PU11                      PWR_PUCRI_PU11_Msk                      /*!< Apply pull-up for PI11 */
#define PWR_PUCRI_PU12_Pos                  (12UL)
#define PWR_PUCRI_PU12_Msk                  (0x1UL << PWR_PUCRI_PU12_Pos)           /*!< 0x00001000 */
#define PWR_PUCRI_PU12                      PWR_PUCRI_PU12_Msk                      /*!< Apply pull-up for PI12 */
#define PWR_PUCRI_PU13_Pos                  (13UL)
#define PWR_PUCRI_PU13_Msk                  (0x1UL << PWR_PUCRI_PU13_Pos)           /*!< 0x00002000 */
#define PWR_PUCRI_PU13                      PWR_PUCRI_PU13_Msk                      /*!< Apply pull-up for PI13 */
#define PWR_PUCRI_PU14_Pos                  (14UL)
#define PWR_PUCRI_PU14_Msk                  (0x1UL << PWR_PUCRI_PU14_Pos)           /*!< 0x00004000 */
#define PWR_PUCRI_PU14                      PWR_PUCRI_PU14_Msk                      /*!< Apply pull-up for PI14 */
#define PWR_PUCRI_PU15_Pos                  (15UL)
#define PWR_PUCRI_PU15_Msk                  (0x1UL << PWR_PUCRI_PU15_Pos)           /*!< 0x00008000 */
#define PWR_PUCRI_PU15                      PWR_PUCRI_PU15_Msk                      /*!< Apply pull-up for PI15 */
#endif /* $U5_4M$ */
#endif /* !$U5_512K$ */

#if !$U5_512K$
/********************  Bit definition for PWR_PDCRI register  *****************/
#define PWR_PDCRI_PD0_Pos                   (0UL)
#define PWR_PDCRI_PD0_Msk                   (0x1UL << PWR_PDCRI_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRI_PD0                       PWR_PDCRI_PD0_Msk                       /*!< Apply pull-down for PI0  */
#define PWR_PDCRI_PD1_Pos                   (1UL)
#define PWR_PDCRI_PD1_Msk                   (0x1UL << PWR_PDCRI_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRI_PD1                       PWR_PDCRI_PD1_Msk                       /*!< Apply pull-down for PI1  */
#define PWR_PDCRI_PD2_Pos                   (2UL)
#define PWR_PDCRI_PD2_Msk                   (0x1UL << PWR_PDCRI_PD2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRI_PD2                       PWR_PDCRI_PD2_Msk                       /*!< Apply pull-down for PI2  */
#define PWR_PDCRI_PD3_Pos                   (3UL)
#define PWR_PDCRI_PD3_Msk                   (0x1UL << PWR_PDCRI_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRI_PD3                       PWR_PDCRI_PD3_Msk                       /*!< Apply pull-down for PI3  */
#define PWR_PDCRI_PD4_Pos                   (4UL)
#define PWR_PDCRI_PD4_Msk                   (0x1UL << PWR_PDCRI_PD4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRI_PD4                       PWR_PDCRI_PD4_Msk                       /*!< Apply pull-down for PI4  */
#define PWR_PDCRI_PD5_Pos                   (5UL)
#define PWR_PDCRI_PD5_Msk                   (0x1UL << PWR_PDCRI_PD5_Pos)            /*!< 0x00000020 */
#define PWR_PDCRI_PD5                       PWR_PDCRI_PD5_Msk                       /*!< Apply pull-down for PI5  */
#define PWR_PDCRI_PD6_Pos                   (6UL)
#define PWR_PDCRI_PD6_Msk                   (0x1UL << PWR_PDCRI_PD6_Pos)            /*!< 0x00000040 */
#define PWR_PDCRI_PD6                       PWR_PDCRI_PD6_Msk                       /*!< Apply pull-down for PI6  */
#define PWR_PDCRI_PD7_Pos                   (7UL)
#define PWR_PDCRI_PD7_Msk                   (0x1UL << PWR_PDCRI_PD7_Pos)            /*!< 0x00000080 */
#define PWR_PDCRI_PD7                       PWR_PDCRI_PD7_Msk                       /*!< Apply pull-down for PI7  */
#if $U5_4M$
#define PWR_PDCRI_PD8_Pos                   (8UL)
#define PWR_PDCRI_PD8_Msk                   (0x1UL << PWR_PDCRI_PD8_Pos)            /*!< 0x00000100 */
#define PWR_PDCRI_PD8                       PWR_PDCRI_PD8_Msk                       /*!< Apply pull-down for PI8  */
#define PWR_PDCRI_PD9_Pos                   (9UL)
#define PWR_PDCRI_PD9_Msk                   (0x1UL << PWR_PDCRI_PD9_Pos)            /*!< 0x00000200 */
#define PWR_PDCRI_PD9                       PWR_PDCRI_PD9_Msk                       /*!< Apply pull-down for PI9  */
#define PWR_PDCRI_PD10_Pos                  (10UL)
#define PWR_PDCRI_PD10_Msk                  (0x1UL << PWR_PDCRI_PD10_Pos)           /*!< 0x00000400 */
#define PWR_PDCRI_PD10                      PWR_PDCRI_PD10_Msk                      /*!< Apply pull-down for PI10 */
#define PWR_PDCRI_PD11_Pos                  (11UL)
#define PWR_PDCRI_PD11_Msk                  (0x1UL << PWR_PDCRI_PD11_Pos)           /*!< 0x00000800 */
#define PWR_PDCRI_PD11                      PWR_PDCRI_PD11_Msk                      /*!< Apply pull-down for PI11 */
#define PWR_PDCRI_PD12_Pos                  (12UL)
#define PWR_PDCRI_PD12_Msk                  (0x1UL << PWR_PDCRI_PD12_Pos)           /*!< 0x00001000 */
#define PWR_PDCRI_PD12                      PWR_PDCRI_PD12_Msk                      /*!< Apply pull-down for PI12 */
#define PWR_PDCRI_PD13_Pos                  (13UL)
#define PWR_PDCRI_PD13_Msk                  (0x1UL << PWR_PDCRI_PD13_Pos)           /*!< 0x00002000 */
#define PWR_PDCRI_PD13                      PWR_PDCRI_PD13_Msk                      /*!< Apply pull-down for PI13 */
#define PWR_PDCRI_PD14_Pos                  (14UL)
#define PWR_PDCRI_PD14_Msk                  (0x1UL << PWR_PDCRI_PD14_Pos)           /*!< 0x00004000 */
#define PWR_PDCRI_PD14                      PWR_PDCRI_PD14_Msk                      /*!< Apply pull-down for PI14 */
#define PWR_PDCRI_PD15_Pos                  (15UL)
#define PWR_PDCRI_PD15_Msk                  (0x1UL << PWR_PDCRI_PD15_Pos)           /*!< 0x00008000 */
#define PWR_PDCRI_PD15                      PWR_PDCRI_PD15_Msk                      /*!< Apply pull-down for PI15 */
#endif /* $U5_4M$ */
#endif /* !$U5_512K$ */
#if $U5_4M$
/********************  Bit definition for PWR_PUCRJ register  *****************/
#define PWR_PUCRJ_PU0_Pos                   (0UL)
#define PWR_PUCRJ_PU0_Msk                   (0x1UL << PWR_PUCRJ_PU0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRJ_PU0                       PWR_PUCRJ_PU0_Msk                       /*!< Apply pull-up for PJ0  */
#define PWR_PUCRJ_PU1_Pos                   (1UL)
#define PWR_PUCRJ_PU1_Msk                   (0x1UL << PWR_PUCRJ_PU1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRJ_PU1                       PWR_PUCRJ_PU1_Msk                       /*!< Apply pull-up for PJ1  */
#define PWR_PUCRJ_PU2_Pos                   (2UL)
#define PWR_PUCRJ_PU2_Msk                   (0x1UL << PWR_PUCRJ_PU2_Pos)            /*!< 0x00000004 */
#define PWR_PUCRJ_PU2                       PWR_PUCRJ_PU2_Msk                       /*!< Apply pull-up for PJ2  */
#define PWR_PUCRJ_PU3_Pos                   (3UL)
#define PWR_PUCRJ_PU3_Msk                   (0x1UL << PWR_PUCRJ_PU3_Pos)            /*!< 0x00000008 */
#define PWR_PUCRJ_PU3                       PWR_PUCRJ_PU3_Msk                       /*!< Apply pull-up for PJ3  */
#define PWR_PUCRJ_PU4_Pos                   (4UL)
#define PWR_PUCRJ_PU4_Msk                   (0x1UL << PWR_PUCRJ_PU4_Pos)            /*!< 0x00000010 */
#define PWR_PUCRJ_PU4                       PWR_PUCRJ_PU4_Msk                       /*!< Apply pull-up for PJ4  */
#define PWR_PUCRJ_PU5_Pos                   (5UL)
#define PWR_PUCRJ_PU5_Msk                   (0x1UL << PWR_PUCRJ_PU5_Pos)            /*!< 0x00000020 */
#define PWR_PUCRJ_PU5                       PWR_PUCRJ_PU5_Msk                       /*!< Apply pull-up for PJ5  */
#define PWR_PUCRJ_PU6_Pos                   (6UL)
#define PWR_PUCRJ_PU6_Msk                   (0x1UL << PWR_PUCRJ_PU6_Pos)            /*!< 0x00000040 */
#define PWR_PUCRJ_PU6                       PWR_PUCRJ_PU6_Msk                       /*!< Apply pull-up for PJ6  */
#define PWR_PUCRJ_PU7_Pos                   (7UL)
#define PWR_PUCRJ_PU7_Msk                   (0x1UL << PWR_PUCRJ_PU7_Pos)            /*!< 0x00000080 */
#define PWR_PUCRJ_PU7                       PWR_PUCRJ_PU7_Msk                       /*!< Apply pull-up for PJ7  */
#define PWR_PUCRJ_PU8_Pos                   (8UL)
#define PWR_PUCRJ_PU8_Msk                   (0x1UL << PWR_PUCRJ_PU8_Pos)            /*!< 0x00000100 */
#define PWR_PUCRJ_PU8                       PWR_PUCRJ_PU8_Msk                       /*!< Apply pull-up for PJ8  */
#define PWR_PUCRJ_PU9_Pos                   (9UL)
#define PWR_PUCRJ_PU9_Msk                   (0x1UL << PWR_PUCRJ_PU9_Pos)            /*!< 0x00000200 */
#define PWR_PUCRJ_PU9                       PWR_PUCRJ_PU9_Msk                       /*!< Apply pull-up for PJ9  */
#define PWR_PUCRJ_PU10_Pos                  (10UL)
#define PWR_PUCRJ_PU10_Msk                  (0x1UL << PWR_PUCRJ_PU10_Pos)           /*!< 0x00000400 */
#define PWR_PUCRJ_PU10                      PWR_PUCRJ_PU10_Msk                      /*!< Apply pull-up for PJ10 */
#define PWR_PUCRJ_PU11_Pos                  (11UL)
#define PWR_PUCRJ_PU11_Msk                  (0x1UL << PWR_PUCRJ_PU11_Pos)           /*!< 0x00000800 */
#define PWR_PUCRJ_PU11                      PWR_PUCRJ_PU11_Msk                      /*!< Apply pull-up for PJ11 */

