STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U5xx/Include/stm32u5xxxxx.h
/***************  Bits definition for register x=1 (GTZC1) *************/
#define GTZC_CFGR1_TIM2_Pos                 (0UL)
#define GTZC_CFGR1_TIM2_Msk                 (0x01UL << GTZC_CFGR1_TIM2_Pos)
#define GTZC_CFGR1_TIM3_Pos                 (1UL)
#define GTZC_CFGR1_TIM3_Msk                 (0x01UL << GTZC_CFGR1_TIM3_Pos)
#define GTZC_CFGR1_TIM4_Pos                 (2UL)
#define GTZC_CFGR1_TIM4_Msk                 (0x01UL << GTZC_CFGR1_TIM4_Pos)
#define GTZC_CFGR1_TIM5_Pos                 (3UL)
#define GTZC_CFGR1_TIM5_Msk                 (0x01UL << GTZC_CFGR1_TIM5_Pos)
#define GTZC_CFGR1_TIM6_Pos                 (4UL)
#define GTZC_CFGR1_TIM6_Msk                 (0x01UL << GTZC_CFGR1_TIM6_Pos)
#define GTZC_CFGR1_TIM7_Pos                 (5UL)
#define GTZC_CFGR1_TIM7_Msk                 (0x01UL << GTZC_CFGR1_TIM7_Pos)
#define GTZC_CFGR1_WWDG_Pos                 (6UL)
#define GTZC_CFGR1_WWDG_Msk                 (0x01UL << GTZC_CFGR1_WWDG_Pos)
#define GTZC_CFGR1_IWDG_Pos                 (7UL)
#define GTZC_CFGR1_IWDG_Msk                 (0x01UL << GTZC_CFGR1_IWDG_Pos)
#define GTZC_CFGR1_SPI2_Pos                 (8UL)
#define GTZC_CFGR1_SPI2_Msk                 (0x01UL << GTZC_CFGR1_SPI2_Pos)
#if !$U5_512K$
#define GTZC_CFGR1_USART2_Pos               (9UL)
#define GTZC_CFGR1_USART2_Msk               (0x01UL << GTZC_CFGR1_USART2_Pos)
#endif /* !U5_512K */
#define GTZC_CFGR1_USART3_Pos               (10UL)
#define GTZC_CFGR1_USART3_Msk               (0x01UL << GTZC_CFGR1_USART3_Pos)
#define GTZC_CFGR1_UART4_Pos                (11UL)
#define GTZC_CFGR1_UART4_Msk                (0x01UL << GTZC_CFGR1_UART4_Pos)
#define GTZC_CFGR1_UART5_Pos                (12UL)
#define GTZC_CFGR1_UART5_Msk                (0x01UL << GTZC_CFGR1_UART5_Pos)
#define GTZC_CFGR1_I2C1_Pos                 (13UL)
#define GTZC_CFGR1_I2C1_Msk                 (0x01UL << GTZC_CFGR1_I2C1_Pos)
#define GTZC_CFGR1_I2C2_Pos                 (14UL)
#define GTZC_CFGR1_I2C2_Msk                 (0x01UL << GTZC_CFGR1_I2C2_Pos)
#define GTZC_CFGR1_CRS_Pos                  (15UL)
#define GTZC_CFGR1_CRS_Msk                  (0x01UL << GTZC_CFGR1_CRS_Pos)
#define GTZC_CFGR1_I2C4_Pos                 (16UL)
#define GTZC_CFGR1_I2C4_Msk                 (0x01UL << GTZC_CFGR1_I2C4_Pos)
#define GTZC_CFGR1_LPTIM2_Pos               (17UL)
#define GTZC_CFGR1_LPTIM2_Msk               (0x01UL << GTZC_CFGR1_LPTIM2_Pos)
#define GTZC_CFGR1_FDCAN1_Pos               (18UL)
#define GTZC_CFGR1_FDCAN1_Msk               (0x01UL << GTZC_CFGR1_FDCAN1_Pos)
#if !$U5_512K$
#define GTZC_CFGR1_UCPD1_Pos                (19UL)
#define GTZC_CFGR1_UCPD1_Msk                (0x01UL << GTZC_CFGR1_UCPD1_Pos)
#endif /* !U5_512K */
#if $U5_4M$ || $U5_TIGER$
#define GTZC_CFGR1_USART6_Pos               (21UL)
#define GTZC_CFGR1_USART6_Msk               (0x01UL << GTZC_CFGR1_USART6_Pos)
#define GTZC_CFGR1_I2C5_Pos                 (22UL)
#define GTZC_CFGR1_I2C5_Msk                 (0x01UL << GTZC_CFGR1_I2C5_Pos)
#define GTZC_CFGR1_I2C6_Pos                 (23UL)
#define GTZC_CFGR1_I2C6_Msk                 (0x01UL << GTZC_CFGR1_I2C6_Pos)
#endif /* $U5_4M$ || $U5_TIGER$ */

/***************  Bits definition for register x=2 (GTZC1) *************/
#define GTZC_CFGR2_TIM1_Pos                 (0UL)
#define GTZC_CFGR2_TIM1_Msk                 (0x01UL << GTZC_CFGR2_TIM1_Pos)
#define GTZC_CFGR2_SPI1_Pos                 (1UL)
#define GTZC_CFGR2_SPI1_Msk                 (0x01UL << GTZC_CFGR2_SPI1_Pos)
#define GTZC_CFGR2_TIM8_Pos                 (2UL)
#define GTZC_CFGR2_TIM8_Msk                 (0x01UL << GTZC_CFGR2_TIM8_Pos)
#define GTZC_CFGR2_USART1_Pos               (3UL)
#define GTZC_CFGR2_USART1_Msk               (0x01UL << GTZC_CFGR2_USART1_Pos)
#define GTZC_CFGR2_TIM15_Pos                (4UL)
#define GTZC_CFGR2_TIM15_Msk                (0x01UL << GTZC_CFGR2_TIM15_Pos)
#define GTZC_CFGR2_TIM16_Pos                (5UL)
#define GTZC_CFGR2_TIM16_Msk                (0x01UL << GTZC_CFGR2_TIM16_Pos)
#define GTZC_CFGR2_TIM17_Pos                (6UL)
#define GTZC_CFGR2_TIM17_Msk                (0x01UL << GTZC_CFGR2_TIM17_Pos)
#define GTZC_CFGR2_SAI1_Pos                 (7UL)
#define GTZC_CFGR2_SAI1_Msk                 (0x01UL << GTZC_CFGR2_SAI1_Pos)
#if !$U5_512K$
#define GTZC_CFGR2_SAI2_Pos                 (8UL)
#define GTZC_CFGR2_SAI2_Msk                 (0x01UL << GTZC_CFGR2_SAI2_Pos)
#endif /* !U5_512K */
#if $U5_TIGER$ || $U5_512K$ || $U5_4M$
#define GTZC_CFGR2_LTDCUSB_Pos              (9UL)
#define GTZC_CFGR2_LTDCUSB_Msk              (0x01UL << GTZC_CFGR2_LTDCUSB_Pos)
#endif /* $U5_TIGER$ || $U5_512K$ || $U5_4M$ */
#if $U5_GFX$ || $U5_TIGER$
#if !$U5_DSI$
#define GTZC_CFGR2_DSI_Pos                  (10UL)
#define GTZC_CFGR2_DSI_Msk                  (0x01UL << GTZC_CFGR2_DSI_Pos)
#endif /* !U5_DSI */
#endif /* $U5_GFX$ || $U5_TIGER$ */
#if $U5_TIGER$
#define GTZC_CFGR2_GFXTIM_Pos               (11UL)
#define GTZC_CFGR2_GFXTIM_Msk               (0x01UL << GTZC_CFGR2_GFXTIM_Pos)
#endif /* $U5_TIGER$ */

/***************  Bits definition for register x=3 (GTZC1) *************/
#define GTZC_CFGR3_MDF1_Pos                 (0UL)
#define GTZC_CFGR3_MDF1_Msk                 (0x01UL << GTZC_CFGR3_MDF1_Pos)
#define GTZC_CFGR3_CORDIC_Pos               (1UL)
#define GTZC_CFGR3_CORDIC_Msk               (0x01UL << GTZC_CFGR3_CORDIC_Pos)
#define GTZC_CFGR3_FMAC_Pos                 (2UL)
#define GTZC_CFGR3_FMAC_Msk                 (0x01UL << GTZC_CFGR3_FMAC_Pos)
#define GTZC_CFGR3_CRC_Pos                  (3UL)
#define GTZC_CFGR3_CRC_Msk                  (0x01UL << GTZC_CFGR3_CRC_Pos)
#define GTZC_CFGR3_TSC_Pos                  (4UL)
#define GTZC_CFGR3_TSC_Msk                  (0x01UL << GTZC_CFGR3_TSC_Pos)
#if !$U5_512K$
#define GTZC_CFGR3_DMA2D_Pos                (5UL)
#define GTZC_CFGR3_DMA2D_Msk                (0x01UL << GTZC_CFGR3_DMA2D_Pos)
#endif /* !U5_512K */
#define GTZC_CFGR3_ICACHE_REG_Pos           (6UL)
#define GTZC_CFGR3_ICACHE_REG_Msk           (0x01UL << GTZC_CFGR3_ICACHE_REG_Pos)
#define GTZC_CFGR3_DCACHE1_REG_Pos          (7UL)
#define GTZC_CFGR3_DCACHE1_REG_Msk          (0x01UL << GTZC_CFGR3_DCACHE1_REG_Pos)
#define GTZC_CFGR3_ADC12_Pos                (8UL)
#define GTZC_CFGR3_ADC12_Msk                (0x01UL << GTZC_CFGR3_ADC12_Pos)
#define GTZC_CFGR3_DCMI_Pos                 (9UL)
#define GTZC_CFGR3_DCMI_Msk                 (0x01UL << GTZC_CFGR3_DCMI_Pos)
#if !$U5_512K$
#define GTZC_CFGR3_OTG_Pos                  (10UL)
#define GTZC_CFGR3_OTG_Msk                  (0x01UL << GTZC_CFGR3_OTG_Pos)
#endif /* !U5_512K */
#if $U5_CRYPTO$
#define GTZC_CFGR3_AES_Pos                  (11UL)
#define GTZC_CFGR3_AES_Msk                  (0x01UL << GTZC_CFGR3_AES_Pos)
#endif /* U5_CRYPTO */
#define GTZC_CFGR3_HASH_Pos                 (12UL)
#define GTZC_CFGR3_HASH_Msk                 (0x01UL << GTZC_CFGR3_HASH_Pos)
#define GTZC_CFGR3_RNG_Pos                  (13UL)
#define GTZC_CFGR3_RNG_Msk                  (0x01UL << GTZC_CFGR3_RNG_Pos)
#if $U5_CRYPTO$
#define GTZC_CFGR3_PKA_Pos                  (14UL)
#define GTZC_CFGR3_PKA_Msk                  (0x01UL << GTZC_CFGR3_PKA_Pos)
#define GTZC_CFGR3_SAES_Pos                 (15UL)
#define GTZC_CFGR3_SAES_Msk                 (0x01UL << GTZC_CFGR3_SAES_Pos)
#endif /* U5_CRYPTO */
#if !$U5_512K$
#define GTZC_CFGR3_OCTOSPIM_Pos             (16UL)
#define GTZC_CFGR3_OCTOSPIM_Msk             (0x01UL << GTZC_CFGR3_OCTOSPIM_Pos)
#endif /* !U5_512K */
#define GTZC_CFGR3_SDMMC1_Pos               (17UL)
#define GTZC_CFGR3_SDMMC1_Msk               (0x01UL << GTZC_CFGR3_SDMMC1_Pos)
#if !$U5_512K$
#define GTZC_CFGR3_SDMMC2_Pos               (18UL)
#define GTZC_CFGR3_SDMMC2_Msk               (0x01UL << GTZC_CFGR3_SDMMC2_Pos)
#define GTZC_CFGR3_FSMC_REG_Pos             (19UL)
#define GTZC_CFGR3_FSMC_REG_Msk             (0x01UL << GTZC_CFGR3_FSMC_REG_Pos)
#endif /* !U5_512K */
#define GTZC_CFGR3_OCTOSPI1_REG_Pos         (20UL)
#define GTZC_CFGR3_OCTOSPI1_REG_Msk         (0x01UL << GTZC_CFGR3_OCTOSPI1_REG_Pos)
#if !$U5_512K$
#define GTZC_CFGR3_OCTOSPI2_REG_Pos         (21UL)
#define GTZC_CFGR3_OCTOSPI2_REG_Msk         (0x01UL << GTZC_CFGR3_OCTOSPI2_REG_Pos)
#endif /* !U5_512K */
#define GTZC_CFGR3_RAMCFG_Pos               (22UL)
#define GTZC_CFGR3_RAMCFG_Msk               (0x01UL << GTZC_CFGR3_RAMCFG_Pos)
#if $U5_GFX$ || $U5_TIGER$
#define GTZC_CFGR3_GPU2D_Pos                (23UL)
#define GTZC_CFGR3_GPU2D_Msk                (0x01UL << GTZC_CFGR3_GPU2D_Pos)
#define GTZC_CFGR3_GFXMMU_Pos               (24UL)
#define GTZC_CFGR3_GFXMMU_Msk               (0x01UL << GTZC_CFGR3_GFXMMU_Pos)
#define GTZC_CFGR3_GFXMMU_REG_Pos           (25UL)
#define GTZC_CFGR3_GFXMMU_REG_Msk           (0x01UL << GTZC_CFGR3_GFXMMU_REG_Pos)
#endif /* $U5_GFX$ || $U5_TIGER$ */
#if $U5_4M$ || $U5_TIGER$
#define GTZC_CFGR3_HSPI1_REG_Pos            (26UL)
#define GTZC_CFGR3_HSPI1_REG_Msk            (0x01UL << GTZC_CFGR3_HSPI1_REG_Pos)
#endif /* $U5_4M$ || $U5_TIGER$ */
#if $U5_GFX$ || $U5_TIGER$
#define GTZC_CFGR3_DCACHE2_REG_Pos          (27UL)
#define GTZC_CFGR3_DCACHE2_REG_Msk          (0x01UL << GTZC_CFGR3_DCACHE2_REG_Pos)
#endif /* $U5_GFX$ || $U5_TIGER$ */
#if $U5_TIGER$
#define GTZC_CFGR3_JPEG_Pos                 (28UL)
#define GTZC_CFGR3_JPEG_Msk                 (0x01UL << GTZC_CFGR3_JPEG_Pos)
#endif /* $U5_TIGER$ */

