STMicroelectronics/X-CUBE-MEMS1/Drivers/CMSIS/Device/ST/STM32U5xx/Include/stm32u5xxxxx.h
/********************  Bit definition for USB_OTG_DOEPINT register  ********************/
#define USB_OTG_DOEPINT_XFRC_Pos                 (0UL)
#define USB_OTG_DOEPINT_XFRC_Msk                 (0x1UL << USB_OTG_DOEPINT_XFRC_Pos)           /*!< 0x00000001 */
#define USB_OTG_DOEPINT_XFRC                     USB_OTG_DOEPINT_XFRC_Msk                     /*!< Transfer completed interrupt */
#define USB_OTG_DOEPINT_EPDISD_Pos               (1UL)
#define USB_OTG_DOEPINT_EPDISD_Msk               (0x1UL << USB_OTG_DOEPINT_EPDISD_Pos)         /*!< 0x00000002 */
#define USB_OTG_DOEPINT_EPDISD                   USB_OTG_DOEPINT_EPDISD_Msk                   /*!< Endpoint disabled interrupt */
#define USB_OTG_DOEPINT_AHBERR_Pos               (2UL)
#define USB_OTG_DOEPINT_AHBERR_Msk               (0x1UL << USB_OTG_DOEPINT_AHBERR_Pos)         /*!< 0x00000004 */
#define USB_OTG_DOEPINT_AHBERR                   USB_OTG_DOEPINT_AHBERR_Msk                   /*!< AHB error */
#define USB_OTG_DOEPINT_STUP_Pos                 (3UL)
#define USB_OTG_DOEPINT_STUP_Msk                 (0x1UL << USB_OTG_DOEPINT_STUP_Pos)           /*!< 0x00000008 */
#define USB_OTG_DOEPINT_STUP                     USB_OTG_DOEPINT_STUP_Msk                     /*!< SETUP phase done */
#define USB_OTG_DOEPINT_OTEPDIS_Pos              (4UL)
#define USB_OTG_DOEPINT_OTEPDIS_Msk              (0x1UL << USB_OTG_DOEPINT_OTEPDIS_Pos)        /*!< 0x00000010 */
#define USB_OTG_DOEPINT_OTEPDIS                  USB_OTG_DOEPINT_OTEPDIS_Msk                  /*!< OUT token received when endpoint disabled */
#define USB_OTG_DOEPINT_STSPHSRX_Pos             (5UL)
#define USB_OTG_DOEPINT_STSPHSRX_Msk             (0x1UL << USB_OTG_DOEPINT_STSPHSRX_Pos)        /*!< 0x00000010 */
#define USB_OTG_DOEPINT_STSPHSRX                 USB_OTG_DOEPINT_STSPHSRX_Msk                  /*!< OUT token received when endpoint disabled */
#define USB_OTG_DOEPINT_B2BSTUP_Pos              (6UL)
#define USB_OTG_DOEPINT_B2BSTUP_Msk              (0x1UL << USB_OTG_DOEPINT_B2BSTUP_Pos)        /*!< 0x00000040 */
#define USB_OTG_DOEPINT_B2BSTUP                  USB_OTG_DOEPINT_B2BSTUP_Msk                  /*!< Back-to-back SETUP packets received */
#define USB_OTG_DOEPINT_OUTPKTERR_Pos            (8UL)
#define USB_OTG_DOEPINT_OUTPKTERR_Msk            (0x1UL << USB_OTG_DOEPINT_OUTPKTERR_Pos)      /*!< 0x00000100 */
#define USB_OTG_DOEPINT_OUTPKTERR                USB_OTG_DOEPINT_OUTPKTERR_Msk                /*!< OUT packet error */
#define USB_OTG_DOEPINT_BERR_Pos                 (12UL)
#define USB_OTG_DOEPINT_BERR_Msk                 (0x1UL << USB_OTG_DOEPINT_BERR_Pos)           /*!< 0x00001000 */
#define USB_OTG_DOEPINT_BERR                     USB_OTG_DOEPINT_BERR_Msk                     /*!< Babble error interrupt */
#define USB_OTG_DOEPINT_NAK_Pos                  (13UL)
#define USB_OTG_DOEPINT_NAK_Msk                  (0x1UL << USB_OTG_DOEPINT_NAK_Pos)            /*!< 0x00002000 */
#define USB_OTG_DOEPINT_NAK                      USB_OTG_DOEPINT_NAK_Msk                      /*!< NAK input */
#define USB_OTG_DOEPINT_NYET_Pos                 (14UL)
#define USB_OTG_DOEPINT_NYET_Msk                 (0x1UL << USB_OTG_DOEPINT_NYET_Pos)           /*!< 0x00004000 */
#define USB_OTG_DOEPINT_NYET                     USB_OTG_DOEPINT_NYET_Msk                     /*!< NYET interrupt */
#define USB_OTG_DOEPINT_STPKTRX_Pos              (15UL)
#define USB_OTG_DOEPINT_STPKTRX_Msk              (0x1UL << USB_OTG_DOEPINT_STPKTRX_Pos)        /*!< 0x00008000 */
#define USB_OTG_DOEPINT_STPKTRX                  USB_OTG_DOEPINT_STPKTRX_Msk                  /*!< Setup packet received */

/********************  Bit definition for USB_OTG_DOEPTSIZ register  ********************/
#define USB_OTG_DOEPTSIZ_XFRSIZ_Pos              (0UL)
#define USB_OTG_DOEPTSIZ_XFRSIZ_Msk              (0x7FFFFUL << USB_OTG_DOEPTSIZ_XFRSIZ_Pos)    /*!< 0x0007FFFF */
#define USB_OTG_DOEPTSIZ_XFRSIZ                  USB_OTG_DOEPTSIZ_XFRSIZ_Msk                  /*!< Transfer size */
#define USB_OTG_DOEPTSIZ_PKTCNT_Pos              (19UL)
#define USB_OTG_DOEPTSIZ_PKTCNT_Msk              (0x3FFUL << USB_OTG_DOEPTSIZ_PKTCNT_Pos)      /*!< 0x1FF80000 */
#define USB_OTG_DOEPTSIZ_PKTCNT                  USB_OTG_DOEPTSIZ_PKTCNT_Msk                  /*!< Packet count */

#define USB_OTG_DOEPTSIZ_RXDPID_Pos             (29UL)
#define USB_OTG_DOEPTSIZ_RXDPID_Msk             (0x3UL << USB_OTG_DOEPTSIZ_RXDPID_Pos)         /*!< 0x60000000 */
#define USB_OTG_DOEPTSIZ_RXDPID                 USB_OTG_DOEPTSIZ_RXDPID_Msk                   /*!< SETUP packet count */
#define USB_OTG_DOEPTSIZ_RXDPID_0               (0x1UL << USB_OTG_DOEPTSIZ_RXDPID_Pos)         /*!< 0x20000000 */
#define USB_OTG_DOEPTSIZ_RXDPID_1               (0x2UL << USB_OTG_DOEPTSIZ_RXDPID_Pos)         /*!< 0x40000000 */

/********************  Bit definition for PCGCCTL register  ********************/
#define USB_OTG_PCGCCTL_STPPCLK_Pos              (0UL)
#define USB_OTG_PCGCCTL_STPPCLK_Msk              (0x1U << USB_OTG_PCGCCTL_STPPCLK_Pos)        /*!< 0x00000001 */
#define USB_OTG_PCGCCTL_STPPCLK                  USB_OTG_PCGCCTL_STPPCLK_Msk                  /*!< SETUP packet count */
#define USB_OTG_PCGCCTL_GATEHCLK_Pos             (1UL)
#define USB_OTG_PCGCCTL_GATEHCLK_Msk             (0x1U << USB_OTG_PCGCCTL_GATEHCLK_Pos)       /*!< 0x00000002 */
#define USB_OTG_PCGCCTL_GATEHCLK                 USB_OTG_PCGCCTL_GATEHCLK_Msk                 /*!< Gate HCLK */
#define USB_OTG_PCGCCTL_PHYSUSP_Pos              (4UL)
#define USB_OTG_PCGCCTL_PHYSUSP_Msk              (0x1U << USB_OTG_PCGCCTL_PHYSUSP_Pos)        /*!< 0x00000010 */
#define USB_OTG_PCGCCTL_PHYSUSP                  USB_OTG_PCGCCTL_PHYSUSP_Msk                  /*!< PHY suspended */
#define USB_OTG_PCGCCTL_ENL1GTG_Pos              (5UL)
#define USB_OTG_PCGCCTL_ENL1GTG_Msk              (0x1U << USB_OTG_PCGCCTL_ENL1GTG_Pos)        /*!< 0x00000020 */
#define USB_OTG_PCGCCTL_ENL1GTG                  USB_OTG_PCGCCTL_ENL1GTG_Msk                  /*!< Enable sleep clock gating */
#define USB_OTG_PCGCCTL_PHYSLEEP_Pos             (6UL)
#define USB_OTG_PCGCCTL_PHYSLEEP_Msk             (0x1U << USB_OTG_PCGCCTL_PHYSLEEP_Pos)       /*!< 0x00000040 */
#define USB_OTG_PCGCCTL_PHYSLEEP                 USB_OTG_PCGCCTL_PHYSLEEP_Msk                 /*!< PHY in Sleep */
#define USB_OTG_PCGCCTL_SUSP_Pos                 (7UL)
#define USB_OTG_PCGCCTL_SUSP_Msk                 (0x1U << USB_OTG_PCGCCTL_SUSP_Pos)           /*!< 0x00000080 */
#define USB_OTG_PCGCCTL_SUSP                     USB_OTG_PCGCCTL_SUSP_Msk                     /*!< Deep Sleep */

#endif /* !U5_512K */
#if $U5_512K$

/******************************************************************************/
/*                                                                            */
/*                         USB Dual Role Device FS Endpoint registers         */
/*                                                                            */
/******************************************************************************/

